stress.yml
config:
  target: 'http://localhost:5000/'
  phases:
    - duration: 120
      arrivalRate: 20
      rampTo: 50
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/1/"


# config:
#   processor: "./TestGen.js"
#   target: 'http://localhost:3001'
#   http:
#     pool: 75
#   phases:
#     - duration: 60
#       arrivalRate: 1
#       maxVusers: 1
#       name: '1 user for 1 minute, warm up'
#     - duration: 60
#       arrivalRate: 30
#       maxVusers: 30
#       name: "30 users for 1 min"
#     - duration: 120
#       arrivalRate: 100
#       maxVusers: 100
#       name: "100 users for 2 min"
#     - duration: 180
#       arrivalRate: 1000
#       maxVusers: 1000
#       name: '1000 users for 3 min'

# scenarios:
#   - name: "get products"
#     weight: 2
#     flow:
#       -
#         count: 10
#         loop:

#         - function: "getRandomPage"
#         - get:
#               url: "/product/{{id}}"
#   - name: "get shop info"
#     weight: 2
#     flow:
#       -
#         count: 10
#         loop:

#         - function: "getRandomPage"
#         - get:
#             url: "/product/shop/{{id}}"
#   - name: "get colors"
#     weight: 2
#     flow:
#       -
#         count: 10
#         loop:

#         - function: "getRandomPage"
#         - get:
#             url: "/product/colors/{{id}}"
#   - name: "create new product"
#     wieght: 1
#     flow:
#     - function: "getProductData"
#     - post:
#          url: "/product/1"
#          json:
#           id: "{{id}}"
#           name: "{{name}}"
#           description: "{{description}}"
#           price: "{{price}}"
#           rating: "{{rating}}"
#           shop_name: "{{shop_name}}"
#           owner_name: "{{owner_name}}"
#           total_sales: "{{total_sales}}"
#           location: "{{location}}"
#           colors: "{{colors}}"